<a href="https://colab.research.google.com/github/sanjana1391/Sanjana-DAML-2021-22/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**PANDAS**

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.1.5'

In [66]:
#dictionary

data={'student':['jack','jill','damon','elena','stefan','klaus'], 'year':[1,2,3,1,4,np.nan],'marks':[100,np.nan,10,145,19,23]}

In [67]:
of= pd.DataFrame(data)
of

  student  year  marks
0    jack   1.0  100.0
1    jill   2.0    NaN
2   damon   3.0   10.0
3   elena   1.0  145.0
4  stefan   4.0   19.0
5   klaus   NaN   23.0

In [5]:
type (df['student'])

pandas.core.series.Series

In [6]:
#to load different data 
df=pd.read_csv('/content/sample_data/california_housing_train.csv')

In [7]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [8]:
df.axes

[RangeIndex(start=0, stop=17000, step=1),
 Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
        'total_bedrooms', 'population', 'households', 'median_income',
        'median_house_value'],
       dtype='object')]

In [9]:
df.axes[1]

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [10]:
df.longitude

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [13]:
df['longitude']

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [14]:
df.rank

<bound method NDFrame.rank of        longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]>

In [20]:
df.iloc[1:4]

   longitude  latitude  ...  median_income  median_house_value
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0

[3 rows x 9 columns]

In [21]:
df.iloc[1:3,0:1]

   longitude
1    -114.47
2    -114.56

In [22]:
df.iloc[:,2:]

       housing_median_age  total_rooms  ...  median_income  median_house_value
0                    15.0       5612.0  ...         1.4936             66900.0
1                    19.0       7650.0  ...         1.8200             80100.0
2                    17.0        720.0  ...         1.6509             85700.0
3                    14.0       1501.0  ...         3.1917             73400.0
4                    20.0       1454.0  ...         1.9250             65500.0
...                   ...          ...  ...            ...                 ...
16995                52.0       2217.0  ...         2.3571            111400.0
16996                36.0       2349.0  ...         2.5179             79000.0
16997                17.0       2677.0  ...         3.0313            103600.0
16998                19.0       2672.0  ...         1.9797             85800.0
16999                52.0       1820.0  ...         3.0147             94600.0

[17000 rows x 7 columns]

fancy indexing

In [25]:
df.loc[:,['longitude','households']]

       longitude  households
0        -114.31       472.0
1        -114.47       463.0
2        -114.56       117.0
3        -114.57       226.0
4        -114.57       262.0
...          ...         ...
16995    -124.26       369.0
16996    -124.27       465.0
16997    -124.30       456.0
16998    -124.30       478.0
16999    -124.35       270.0

[17000 rows x 2 columns]

In [26]:
df.loc[0:2,['longitude','households']]

   longitude  households
0    -114.31       472.0
1    -114.47       463.0
2    -114.56       117.0

In [29]:
df.loc[0:2,'longitude':'households']

   longitude  latitude  ...  population  households
0    -114.31     34.19  ...      1015.0       472.0
1    -114.47     34.40  ...      1129.0       463.0
2    -114.56     33.69  ...       333.0       117.0

[3 rows x 7 columns]


last given index is not included in iloc

series

1.   row
2.   fetching

---

last given index is  included in loc


1.   column
2.   machine learning

boolean masking

In [37]:
df['total_rooms']>6200

0        False
1         True
2        False
3        False
4        False
         ...
16995    False
16996    False
16997    False
16998    False
16999    False
Name: total_rooms, Length: 17000, dtype: bool

In [36]:
df[df['total_rooms']>6200]

       longitude  latitude  ...  median_income  median_house_value
1        -114.47     34.40  ...         1.8200             80100.0
133      -116.06     34.15  ...         2.2466             66800.0
135      -116.09     34.15  ...         2.6111             65600.0
168      -116.24     33.71  ...         2.7598             95000.0
172      -116.26     33.65  ...        10.2948            382400.0
...          ...       ...  ...            ...                 ...
16546    -122.67     38.33  ...         3.9518            220300.0
16568    -122.69     38.37  ...         4.8233            214000.0
16619    -122.72     38.58  ...         5.0555            240800.0
16652    -122.75     38.54  ...         5.4886            254200.0
16679    -122.79     38.48  ...         3.1662            191000.0

[878 rows x 9 columns]

In [38]:
df['Total']=df['total_rooms']*10

In [41]:
df[df.latitude==34.19]

      longitude  latitude  ...  median_house_value    Total
0       -114.31     34.19  ...             66900.0  56120.0
324     -116.88     34.19  ...            225000.0   8980.0
2017    -117.32     34.19  ...            109000.0  10680.0
4941    -118.11     34.19  ...            483300.0  14300.0
5037    -118.12     34.19  ...            444100.0  24050.0
...         ...       ...  ...                 ...      ...
9367    -119.19     34.19  ...            180500.0  25990.0
9384    -119.20     34.19  ...            218500.0  95030.0
9399    -119.21     34.19  ...            242900.0  56140.0
9400    -119.21     34.19  ...            229500.0  37970.0
9426    -119.23     34.19  ...            500001.0  52970.0

[113 rows x 10 columns]

In [44]:
#update values
df.loc[df.latitude==34.19,'total_rooms']=25989
df

       longitude  latitude  ...  median_house_value    Total
0        -114.31     34.19  ...             66900.0  56120.0
1        -114.47     34.40  ...             80100.0  76500.0
2        -114.56     33.69  ...             85700.0   7200.0
3        -114.57     33.64  ...             73400.0  15010.0
4        -114.57     33.57  ...             65500.0  14540.0
...          ...       ...  ...                 ...      ...
16995    -124.26     40.58  ...            111400.0  22170.0
16996    -124.27     40.69  ...             79000.0  23490.0
16997    -124.30     41.84  ...            103600.0  26770.0
16998    -124.30     41.80  ...             85800.0  26720.0
16999    -124.35     40.54  ...             94600.0  18200.0

[17000 rows x 10 columns]

missing values using pandas

In [45]:
v1=pd.Series([1,np.nan,2,None])
v1

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

global function for missing values

In [47]:
df.isnull().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
Total                 0
dtype: int64

In [68]:
of.dropna()

  student  year  marks
0    jack   1.0  100.0
2   damon   3.0   10.0
3   elena   1.0  145.0
4  stefan   4.0   19.0

In [69]:
of.dropna(how='all',axis=1)

  student  year  marks
0    jack   1.0  100.0
1    jill   2.0    NaN
2   damon   3.0   10.0
3   elena   1.0  145.0
4  stefan   4.0   19.0
5   klaus   NaN   23.0

In [70]:
of.year.mean()

2.2

In [74]:
of.fillna(10)

  student  year  marks
0    jack   1.0  100.0
1    jill   2.0   10.0
2   damon   3.0   10.0
3   elena   1.0  145.0
4  stefan   4.0   19.0
5   klaus  10.0   23.0

In [75]:
of.fillna(method='ffill')

  student  year  marks
0    jack   1.0  100.0
1    jill   2.0  100.0
2   damon   3.0   10.0
3   elena   1.0  145.0
4  stefan   4.0   19.0
5   klaus   4.0   23.0

In [76]:
of.fillna(method='bfill')

  student  year  marks
0    jack   1.0  100.0
1    jill   2.0   10.0
2   damon   3.0   10.0
3   elena   1.0  145.0
4  stefan   4.0   19.0
5   klaus   NaN   23.0

In [79]:
of.fillna({'year':20})

  student  year  marks
0    jack   1.0  100.0
1    jill   2.0    NaN
2   damon   3.0   10.0
3   elena   1.0  145.0
4  stefan   4.0   19.0
5   klaus  20.0   23.0

mini project:

objective

*   describe
*   shape
*   tail
*   head
*   example: age range (min,max)
*   missing values
*   frequency(boolean masking)
*